app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("school_class_title", "school_class_room_number") VALUES (?, ?)  [["school_class_title", "kiss"], ["school_class_room_number", "ktf"]]
---
    def create
        @school_class =SchoolClass.create(school_class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_school_class
        @school_class = SchoolClass.find(params[:id])