app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "LUIGI"], ["updated_at", "2019-10-18 16:19:37.095907"], ["id", 3]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(student_params)